<?php
// Heading
$_['heading_title']            = 'Playful Sparkle - Product to Category filter';
$_['heading_getting_started']  = 'Начало работы';
$_['heading_setup']            = 'Настройка модуля Product to Category filter';
$_['heading_troubleshot']      = 'Распространенные проблемы';
$_['heading_contact']          = 'Связаться с поддержкой';

// Text
$_['text_extension']           = 'Расширения';
$_['text_success']             = 'Успех: Вы успешно изменили модуль фильтра продукта для категории!';
$_['text_filter_success']      = 'Успех: Неиспользуемые фильтры были успешно удалены!';
$_['text_edit']                = 'Редактирование модуля фильтра продукта для категории';
$_['text_getting_started']     = '<p><strong>Обзор:</strong> Расширение Playful Sparkle - Фильтр продукта для категории улучшает ваш магазин OpenCart 3.x, упрощая управление фильтрами внутри категорий. После сохранения информации о продукте это расширение автоматически связывает соответствующие фильтры с категориями, экономя время и обеспечивая согласованность в настройке фильтров.</p><p><strong>Требования:</strong> OpenCart 3.x+, PHP 7.3 должно быть установлено и правильно настроено.</p>';
$_['text_setup']               = '<p>Чтобы настроить расширение, установите и активируйте его через панель администратора OpenCart. Перейдите в раздел Расширения > Модули, найдите Playful Sparkle - Фильтр продукта для категории и нажмите кнопку Включить.</p>';
$_['text_troubleshot']         = '<ul><li><strong>Не отображается кнопка "Удалить неиспользуемые фильтры":</strong> Убедитесь, что расширение включено, а модификация активирована и обновлена.</li><li><strong>Фильтры не добавляются в категорию:</strong> Убедитесь, что расширение включено, а модификация активирована и обновлена.</li><li><strong>Фильтры не отображаются на главной странице:</strong> Необходимо включить модуль фильтра и назначить его на макет.</li></ul>';
$_['text_contact']             = '<p>Для дополнительной помощи, пожалуйста, свяжитесь с нашей службой поддержки:</p><ul><li><strong>Контакт:</strong> <a href="mailto:%s">%s</a></li><li><strong>Документация:</strong> <a href="%s" target="_blank" rel="noopener noreferrer">Пользовательская документация</a></li></ul>';

// Tab
$_['tab_general']              = 'Основные';
$_['tab_help_and_support']     = 'Помощь и поддержка';

// Entry
$_['entry_status']             = 'Статус';

// Button
$_['button_remove_filter']     = 'Удалить неиспользуемые фильтры';

// Error
$_['error_permission']         = 'Предупреждение: У вас нет прав для изменения модуля фильтра продукта для категории!';
